garyPenhook/PyAvrOCD/svd/avr32sd28.svd
        <register>
          <name>ESCFLASH2</name>
          <description>Error Source Control FLASH2</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCOPC</name>
          <description>Error Source Control OPC</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCRAM1</name>
          <description>Error Source Control RAM1</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCRAM2</name>
          <description>Error Source Control RAM2</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCSPLIM</name>
          <description>Error Source Control SPLIM</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCSWDT</name>
          <description>Error Source Control SWDT</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCVREGFAIL</name>
          <description>Error Source Control VREGFAIL</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESCVREGWARN</name>
          <description>Error Source Control VREGWARN</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ERRLVL</name>
              <description>Error Severity Level</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRITICAL</name>
                  <description>Critical error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONCRITICAL</name>
                  <description>Noncritical error (reset value)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTIFICATION</name>
                  <description>Notification error</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLOAT</name>
              <description>Float all I/O pins</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESF</name>
          <description>Error Status Flags</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ESF0</name>
              <description>Error Status Flag 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF1</name>
              <description>Error Status Flag 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF2</name>
              <description>Error Status Flag 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF3</name>
              <description>Error Status Flag 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF4</name>
              <description>Error Status Flag 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF5</name>
              <description>Error Status Flag 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF6</name>
              <description>Error Status Flag 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF7</name>
              <description>Error Status Flag 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF8</name>
              <description>Error Status Flag 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF9</name>
              <description>Error Status Flag 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF10</name>
              <description>Error Status Flag 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF11</name>
              <description>Error Status Flag 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF12</name>
              <description>Error Status Flag 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF13</name>
              <description>Error Status Flag 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF14</name>
              <description>Error Status Flag 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF15</name>
              <description>Error Status Flag 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ESF16</name>
              <description>Error Status Flag 16</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESFTEST</name>
          <description>Error Status Flag Test Injection</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ESFTEST0</name>
              <description>Error Status Flag Test Injection 0</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST1</name>
              <description>Error Status Flag Test Injection 1</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST2</name>
              <description>Error Status Flag Test Injection 2</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST3</name>
              <description>Error Status Flag Test Injection 3</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST4</name>
              <description>Error Status Flag Test Injection 4</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST5</name>
              <description>Error Status Flag Test Injection 5</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST6</name>
              <description>Error Status Flag Test Injection 6</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST7</name>
              <description>Error Status Flag Test Injection 7</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST8</name>
              <description>Error Status Flag Test Injection 8</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST9</name>
              <description>Error Status Flag Test Injection 9</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST10</name>
              <description>Error Status Flag Test Injection 10</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST11</name>
              <description>Error Status Flag Test Injection 11</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST12</name>
              <description>Error Status Flag Test Injection 12</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST13</name>
              <description>Error Status Flag Test Injection 13</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST14</name>
              <description>Error Status Flag Test Injection 14</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST15</name>
              <description>Error Status Flag Test Injection 15</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ESFTEST16</name>
              <description>Error Status Flag Test Injection 16</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
