garyPenhook/PyAvrOCD/svd/avr32sd28.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x00800110</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CNT</name>
          <description>Counter</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CNT</name>
              <description>Counter</description>
              <bitRange>[13:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>16383</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Period</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (244 us)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (488 us)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (976 us)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (1.95 ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (3.9 ms)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (7.8 ms)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (15.625 ms)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (31.25 ms)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (62.5 ms)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (125 ms)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (250 ms)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW</name>
              <description>Window</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (244 us)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (488 us)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (976 us)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (1.95 ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (3.9 ms)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (7.8 ms)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (15.625 ms)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (31.25 ms)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (62.5 ms)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (125 ms)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (250 ms)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>WDTMON</name>
              <description>WDT Clock Monitor</description>
              <bitRange>[7:6]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Monitor is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Monitor is always on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Monitor is always on in normal and IDLE mode, but automatically disabled when the MCU is in POWERDOWN and STANDBY sleep modes</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYNCBUSY</name>
              <description>Syncronization busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CNTBUSY</name>
              <description>CNT Synchronization Busy</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CAUSE</name>
              <description>Reset Cause</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTSIDE</name>
                  <description>Outside window</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMEOUT</name>
                  <description>Timeout</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
